1 : Explain the fundamental differences between DDL, DML, and DQL
commands in SQL. Provide one example for each type of command.

ans-

**Data Definition Language (DDL)**


    DDL commands are used to define or modify the structure of database objects
    
    such as tables, indexes, and schemas. They deal with how the data is stored
    
    and the relationships between objects, rather than the data itself.


**Common DDL commands include:**
**CREATE:**

    To create a new database object.


**ALTER**:

    To modify the structure of an existing object.


**DROP**:

    To delete an entire object (and all its data).


**TRUNCATE**:

    To remove all records from a table quickly by deallocating the pages, but leaving the table structure intact.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# SQL DDL command
create_table_sql = """
CREATE TABLE Employees (
    EmployeeID INT PRIMARY KEY,
    LastName VARCHAR(255),
    FirstName VARCHAR(255),
    DepartmentID INT
);
"""

# Execute the DDL command
try:
    cursor.execute(create_table_sql)
    conn.commit()
    print("Table 'Employees' created successfully.")
except sqlite3.Error as e:
    print(f"Error creating table: {e}")
finally:
    conn.close()

Table 'Employees' created successfully.

**Data Manipulation Language (DML)**
  
    DML commands are used for managing the data stored within the database
  
    objects defined by DDL. They are concerned with adding, deleting, and
  
    modifying records. DML operations are not typically auto-committed and often
  
    require a COMMIT or ROLLBACK command to finalize or undo changes.

**Common DML commands include:**


**INSERT**:

    To add new rows of data to a table.


**UPDATE:**

    To modify existing data within a table.


**DELETE**:

    To remove specific rows of data from a table.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Re-create the Employees table for DML demonstration as the previous connection was closed
create_table_sql = """
CREATE TABLE Employees (
    EmployeeID INT PRIMARY KEY,
    LastName VARCHAR(255),
    FirstName VARCHAR(255),
    DepartmentID INT
);
"""
try:
    cursor.execute(create_table_sql)
    conn.commit()
    print("Table 'Employees' re-created for DML operations.")
except sqlite3.Error as e:
    print(f"Error re-creating table: {e}")

# DML Commands
try:
    # INSERT example
    insert_sql = "INSERT INTO Employees (EmployeeID, LastName, FirstName, DepartmentID) VALUES (1, 'Doe', 'John', 101);"
    cursor.execute(insert_sql)
    conn.commit()
    print("DML: Inserted a record.")

    # UPDATE example
    update_sql = "UPDATE Employees SET DepartmentID = 102 WHERE EmployeeID = 1;"
    cursor.execute(update_sql)
    conn.commit()
    print("DML: Updated a record.")

    # DELETE example
    delete_sql = "DELETE FROM Employees WHERE EmployeeID = 1;"
    cursor.execute(delete_sql)
    conn.commit()
    print("DML: Deleted a record.")

    # Verify state (should be empty after delete)
    cursor.execute("SELECT * FROM Employees;")
    remaining_records = cursor.fetchall()
    print(f"DML: Remaining records after all operations: {remaining_records}")

except sqlite3.Error as e:
    print(f"Error during DML operations: {e}")
finally:
    conn.close()

Table 'Employees' re-created for DML operations.
DML: Inserted a record.
DML: Updated a record.
DML: Deleted a record.
DML: Remaining records after all operations: []

**Data Query Language (DQL)**


    DQL commands are used for retrieving data from the database. The primary
    
    purpose is to fetch data based on specific criteria without modifying the
    
    data or the database structure.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Re-create the Employees table and insert some data for DQL demonstration
create_table_sql = """
CREATE TABLE Employees (
    EmployeeID INT PRIMARY KEY,
    LastName VARCHAR(255),
    FirstName VARCHAR(255),
    DepartmentID INT
);
"""

try:
    cursor.execute(create_table_sql)
    conn.commit()
    print("Table 'Employees' re-created for DQL operations.")

    # Insert sample data
    insert_sql_1 = "INSERT INTO Employees (EmployeeID, LastName, FirstName, DepartmentID) VALUES (1, 'Doe', 'John', 101);"
    insert_sql_2 = "INSERT INTO Employees (EmployeeID, LastName, FirstName, DepartmentID) VALUES (2, 'Smith', 'Jane', 102);"
    insert_sql_3 = "INSERT INTO Employees (EmployeeID, LastName, FirstName, DepartmentID) VALUES (3, 'Williams', 'Peter', 101);"
    cursor.execute(insert_sql_1)
    cursor.execute(insert_sql_2)
    cursor.execute(insert_sql_3)
    conn.commit()
    print("Sample data inserted.")

    # DQL command: SELECT example
    select_sql = "SELECT EmployeeID, FirstName, LastName, DepartmentID FROM Employees WHERE DepartmentID = 101;"
    cursor.execute(select_sql)

    # Fetch and print the results
    results = cursor.fetchall()
    print("\nDQL: Records from DepartmentID 101:")
    for row in results:
        print(row)

except sqlite3.Error as e:
    print(f"Error during DQL operations: {e}")
finally:
    conn.close()

Table 'Employees' re-created for DQL operations.
Sample data inserted.

DQL: Records from DepartmentID 101:
(1, 'John', 'Doe', 101)
(3, 'Peter', 'Williams', 101)

 2 : What is the purpose of SQL constraints? Name and describe three common types
of constraints, providing a simple scenario where each would be useful.

ans-



    SQL constraints define rules to limit the data that can be placed into a
    
    table, ensuring the accuracy and reliability of the data within the
    
    database [2, 3]. They are used to enforce business logic and data
    
    integrity, preventing invalid data from being inserted, updated, or
    
    deleted.

3 : Explain the difference between LIMIT and OFFSET clauses in SQL. How
would you use them together to retrieve the third page of results, assuming each page
has 10 records?

ans-

**LIMIT:**

    Specifies the maximum number of rows to retrieve. It defines the size of
    
    the result set.

  **OFFSET:**
  
    Specifies the number of rows to skip from the beginning of the result set
    
    before starting to return the rows. It defines the starting point.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

try:
    # Create a sample table
    cursor.execute("""
        CREATE TABLE Products (
            ProductID INTEGER PRIMARY KEY,
            ProductName TEXT,
            Price REAL
        );
    """)

    # Insert sample data
    for i in range(1, 35):
        cursor.execute(f"INSERT INTO Products (ProductName, Price) VALUES ('Product {i}', {i * 10.0});")
    conn.commit()
    print("Sample table and data created.")

    # DQL command with LIMIT and OFFSET for the third page (10 records per page)
    # Page 1: OFFSET 0, LIMIT 10
    # Page 2: OFFSET 10, LIMIT 10
    # Page 3: OFFSET 20, LIMIT 10
    select_sql = "SELECT ProductID, ProductName, Price FROM Products ORDER BY ProductID LIMIT 10 OFFSET 20;"
    cursor.execute(select_sql)

    # Fetch and print the results
    results = cursor.fetchall()
    print("\nThird page of results (10 records, starting from the 21st record):")
    if results:
        for row in results:
            print(row)
    else:
        print("No records found for the third page.")

except sqlite3.Error as e:
    print(f"Error during SQL operations: {e}")
finally:
    conn.close()

Sample table and data created.

Third page of results (10 records, starting from the 21st record):
(21, 'Product 21', 210.0)
(22, 'Product 22', 220.0)
(23, 'Product 23', 230.0)
(24, 'Product 24', 240.0)
(25, 'Product 25', 250.0)
(26, 'Product 26', 260.0)
(27, 'Product 27', 270.0)
(28, 'Product 28', 280.0)
(29, 'Product 29', 290.0)
(30, 'Product 30', 300.0)

4 : What is a Common Table Expression (CTE) in SQL, and what are its main
benefits? Provide a simple SQL example demonstrating its usage.

ans-


    A Common Table Expression (CTE) is a temporary result set that you can
    
    reference within another SQL statement, such as a SELECT, INSERT, UPDATE
    
    , or DELETE statement [1]. It is defined using the WITH clause and exists
    
    only for the duration of the query in which it is used, not stored
     
    permanently in the database .


---


**Main Benefits**


**The primary benefits of using CTEs include:**


**Readability and Maintainability:**

    CTEs help break down complex, lengthy queries into smaller, more
    
    manageable, and readable parts .


**Recursion Support:**


    They can reference themselves within the WITH clause,

    which is essential for querying hierarchical data such as organizational
  
    charts or bill of materials .


**Replacement for Views (for short-term use):**

   
   
    For complex subqueries that do not need to be saved permanently, a CTE
   
    offers similar benefits to a view without the need to define schema
   
    permissions


**Simplifying Subqueries:**

    CTEs allow you to use the same temporary result set multiple times within
    
    a single query, which can make the code cleaner than repeatedly using
     
    nested subqueries .


**Enhancing Logic: **

  
    They improve the ability to perform set operations (like UNION) on the
    
    temporary result set before joining it with other tables .

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

try:
    # Create Employees table
    cursor.execute("""
        CREATE TABLE Employees (
            EmployeeID INTEGER PRIMARY KEY,
            FirstName TEXT,
            LastName TEXT,
            DepartmentID INTEGER,
            Salary REAL
        );
    """)

    # Create Departments table
    cursor.execute("""
        CREATE TABLE Departments (
            DepartmentID INTEGER PRIMARY KEY,
            DepartmentName TEXT
        );
    """)

    # Insert sample data into Departments
    cursor.execute("INSERT INTO Departments (DepartmentID, DepartmentName) VALUES (101, 'HR');")
    cursor.execute("INSERT INTO Departments (DepartmentID, DepartmentName) VALUES (102, 'Engineering');")
    cursor.execute("INSERT INTO Departments (DepartmentID, DepartmentName) VALUES (103, 'Sales');")

    # Insert sample data into Employees
    cursor.execute("INSERT INTO Employees (EmployeeID, FirstName, LastName, DepartmentID, Salary) VALUES (1, 'John', 'Doe', 101, 65000.0);")
    cursor.execute("INSERT INTO Employees (EmployeeID, FirstName, LastName, DepartmentID, Salary) VALUES (2, 'Jane', 'Smith', 102, 75000.0);")
    cursor.execute("INSERT INTO Employees (EmployeeID, FirstName, LastName, DepartmentID, Salary) VALUES (3, 'Peter', 'Jones', 101, 55000.0);")
    cursor.execute("INSERT INTO Employees (EmployeeID, FirstName, LastName, DepartmentID, Salary) VALUES (4, 'Alice', 'Williams', 102, 80000.0);")
    cursor.execute("INSERT INTO Employees (EmployeeID, FirstName, LastName, DepartmentID, Salary) VALUES (5, 'Robert', 'Brown', 103, 62000.0);")
    cursor.execute("INSERT INTO Employees (EmployeeID, FirstName, LastName, DepartmentID, Salary) VALUES (6, 'Emily', 'Davis', 103, 70000.0);")
    conn.commit()
    print("Sample tables and data created.")

    # Define the Common Table Expression (CTE) called 'AverageSalaries' as a SQL string
    cte_sql = """
    WITH AverageSalaries AS (
        SELECT
            DepartmentID,
            AVG(Salary) AS AvgSalary
        FROM
            Employees
        GROUP BY
            DepartmentID
    )
    -- Use the CTE in the main SELECT query
    SELECT
        D.DepartmentName,
        A.AvgSalary
    FROM
        Departments D
    JOIN
        AverageSalaries A ON D.DepartmentID = A.DepartmentID
    WHERE
        A.AvgSalary > 60000;
    """

    # Execute the CTE query
    cursor.execute(cte_sql)

    # Fetch and print the results
    results = cursor.fetchall()
    print("\nDepartments with average salary greater than 60000:")
    if results:
        for row in results:
            print(row)
    else:
        print("No departments found with average salary greater than 60000.")

except sqlite3.Error as e:
    print(f"Error during SQL operations: {e}")
finally:
    conn.close()

Sample tables and data created.

Departments with average salary greater than 60000:
('Engineering', 77500.0)
('Sales', 66000.0)

 5 : Describe the concept of SQL Normalization and its primary goals. Briefly
explain the first three normal forms (1NF, 2NF, 3NF).

ans-

**1NF (First Normal Form)**

    1NF sets the basic rules for an organized database:

**Atomic Values:**

    Each column must contain atomic, or single, values, meaning no repeating
    
    groups of data or arrays within a single cell .


**Unique Columns:**

    Each column should have a unique name.


**Unique Rows:**

    Each row (record) must be uniquely identifiable (usually through a primary key) .



---


**2NF (Second Normal Form)**


    To be in 2NF, a table must first meet all the requirements of 1NF. Additionally:


**Full Dependency:**

    All non-key attributes (columns that are not part of the primary key) must be fully dependent on the entire primary key .


**Eliminate Partial Dependencies:**

    This form addresses partial dependencies, which occur when a non-key
    
    attribute is dependent on only a portion of a composite primary key
    
    . Data that is not fully dependent on the whole key is moved to a new table.


---



**3NF (Third Normal Form)**


    To be in 3NF, a table must first meet all the requirements of 2NF. Additionally:


**Eliminate Transitive Dependencies**:

    There should be no transitive dependencies.
    
    This means that a non-key attribute should not be dependent on another non-key attribute .


**Direct Dependency on Primary Key:**

    Every non-key attribute must depend directly on the primary key and nothing else
    
    Data that violates this is moved to a new, separate table.

 6 : Create a database named ECommerceDB and perform the following
tasks:
1. Create the following tables with appropriate data types and constraints:
● Categories
○ CategoryID (INT, PRIMARY KEY)
○ CategoryName (VARCHAR(50), NOT NULL, UNIQUE)
● Products
○ ProductID (INT, PRIMARY KEY)
○ ProductName (VARCHAR(100), NOT NULL, UNIQUE)
○ CategoryID (INT, FOREIGN KEY → Categories)
○ Price (DECIMAL(10,2), NOT NULL)
○ StockQuantity (INT)
● Customers
○ CustomerID (INT, PRIMARY KEY)
○ CustomerName (VARCHAR(100), NOT NULL)
○ Email (VARCHAR(100), UNIQUE)
○ JoinDate (DATE)
● Orders
○ OrderID (INT, PRIMARY KEY)
○ CustomerID (INT, FOREIGN KEY → Customers)
○ OrderDate (DATE, NOT NULL)

In [ ]:
!pip install sql

Collecting sql
  Downloading sql-2022.4.0.tar.gz (4.2 kB)
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sql
  Building wheel for sql (setup.py) ... done
  Created wheel for sql: filename=sql-2022.4.0-py3-none-any.whl size=4306 sha256=d7b5251a2a4951bc41839c6105bb8a37f02e1e7b3ba7af943302e2cfe9e5085f
  Stored in directory: /root/.cache/pip/wheels/79/76/71/e469c317928700078d899ef20e051dc7080650b63937324e31
Successfully built sql
Installing collected packages: sql
Successfully installed sql-2022.4.0

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database (this implicitly creates the database)
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

try:
    print("Creating tables in ECommerceDB...")

    # Create Categories table
    cursor.execute("""
        CREATE TABLE Categories (
            CategoryID INTEGER PRIMARY KEY,
            CategoryName VARCHAR(50) NOT NULL UNIQUE
        );
    """)
    print("Table 'Categories' created.")

    # Create Products table
    cursor.execute("""
        CREATE TABLE Products (
            ProductID INTEGER PRIMARY KEY,
            ProductName VARCHAR(100) NOT NULL UNIQUE,
            CategoryID INTEGER,
            Price REAL NOT NULL,
            StockQuantity INTEGER,
            FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
        );
    """)
    print("Table 'Products' created.")

    # Create Customers table
    cursor.execute("""
        CREATE TABLE Customers (
            CustomerID INTEGER PRIMARY KEY,
            CustomerName VARCHAR(100) NOT NULL,
            Email VARCHAR(100) UNIQUE,
            JoinDate DATE
        );
    """)
    print("Table 'Customers' created.")

    # Create Orders table
    cursor.execute("""
        CREATE TABLE Orders (
            OrderID INTEGER PRIMARY KEY,
            CustomerID INTEGER,
            OrderDate DATE NOT NULL,
            FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
        );
    """)
    print("Table 'Orders' created.")

    conn.commit()
    print("All tables created successfully in ECommerceDB.")

except sqlite3.Error as e:
    print(f"Error creating tables: {e}")
    conn.rollback() # Rollback changes if an error occurs
finally:
    conn.close()

Creating tables in ECommerceDB...
Table 'Categories' created.
Table 'Products' created.
Table 'Customers' created.
Table 'Orders' created.
All tables created successfully in ECommerceDB.

In [ ]:
import sqlite3
-- 1. Create Categories table
CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

-- 2. Create Products table
-- Note: It is assumed that IDs are managed by the application or through auto-increment features.
CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10,2) NOT NULL,
    StockQuantity INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

-- 3. Create Customers table
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

-- 4. Create Orders table
CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

SyntaxError: invalid syntax (ipython-input-2662594714.py, line 2)

In [ ]:
import sqlite3
import datetime

# Connect to the in-memory SQLite database
# Note: This will create a new in-memory database.
# In a real application, you would connect to the persistent database file.
# For this demonstration, we'll re-create the tables and data.
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

try:
    print("Re-creating tables and inserting sample data into ECommerceDB...")

    # Re-create Categories table
    cursor.execute("""
        CREATE TABLE Categories (
            CategoryID INTEGER PRIMARY KEY,
            CategoryName VARCHAR(50) NOT NULL UNIQUE
        );
    """)

    # Re-create Products table
    cursor.execute("""
        CREATE TABLE Products (
            ProductID INTEGER PRIMARY KEY,
            ProductName VARCHAR(100) NOT NULL UNIQUE,
            CategoryID INTEGER,
            Price REAL NOT NULL,
            StockQuantity INTEGER,
            FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
        );
    """)

    # Re-create Customers table
    cursor.execute("""
        CREATE TABLE Customers (
            CustomerID INTEGER PRIMARY KEY,
            CustomerName VARCHAR(100) NOT NULL,
            Email VARCHAR(100) UNIQUE,
            JoinDate DATE
        );
    """)

    # Re-create Orders table
    cursor.execute("""
        CREATE TABLE Orders (
            OrderID INTEGER PRIMARY KEY,
            CustomerID INTEGER,
            OrderDate DATE NOT NULL,
            FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
        );
    """)

    print("Tables re-created.")

    # Insert sample data into Categories
    cursor.execute("INSERT INTO Categories (CategoryName) VALUES ('Electronics');")
    cursor.execute("INSERT INTO Categories (CategoryName) VALUES ('Books');")
    cursor.execute("INSERT INTO Categories (CategoryName) VALUES ('Apparel');")
    print("Categories data inserted.")

    # Insert sample data into Products
    cursor.execute("INSERT INTO Products (ProductName, CategoryID, Price, StockQuantity) VALUES ('Laptop', 1, 1200.00, 50);")
    cursor.execute("INSERT INTO Products (ProductName, CategoryID, Price, StockQuantity) VALUES ('Smartphone', 1, 800.00, 150);")
    cursor.execute("INSERT INTO Products (ProductName, CategoryID, Price, StockQuantity) VALUES ('SQL Handbook', 2, 45.50, 200);")
    cursor.execute("INSERT INTO Products (ProductName, CategoryID, Price, StockQuantity) VALUES ('T-Shirt', 3, 25.00, 300);")
    print("Products data inserted.")

    # Insert sample data into Customers
    cursor.execute("INSERT INTO Customers (CustomerName, Email, JoinDate) VALUES ('Alice Smith', 'alice@example.com', '2023-01-15');")
    cursor.execute("INSERT INTO Customers (CustomerName, Email, JoinDate) VALUES ('Bob Johnson', 'bob@example.com', '2023-02-20');")
    cursor.execute("INSERT INTO Customers (CustomerName, Email, JoinDate) VALUES ('Charlie Brown', 'charlie@example.com', '2023-03-10');")
    print("Customers data inserted.")

    # Insert sample data into Orders
    cursor.execute("INSERT INTO Orders (CustomerID, OrderDate) VALUES (1, '2023-04-01');")
    cursor.execute("INSERT INTO Orders (CustomerID, OrderDate) VALUES (1, '2023-04-05');")
    cursor.execute("INSERT INTO Orders (CustomerID, OrderDate) VALUES (2, '2023-04-02');")
    cursor.execute("INSERT INTO Orders (CustomerID, OrderDate) VALUES (3, '2023-04-10');")
    print("Orders data inserted.")

    conn.commit()
    print("All sample data inserted successfully.")

except sqlite3.Error as e:
    print(f"Error inserting data: {e}")
    conn.rollback() # Rollback changes if an error occurs
finally:
    conn.close()

Re-creating tables and inserting sample data into ECommerceDB...
Tables re-created.
Categories data inserted.
Products data inserted.
Customers data inserted.
Orders data inserted.
All sample data inserted successfully.

6 : Create a database named ECommerceDB and perform the following
tasks:

In [2]:
import sqlite3

# Connect to an in-memory SQLite database
# In SQLite, connecting to a database file (or ':memory:') implicitly creates it if it doesn't exist.
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

try:
    print("Creating tables for ECommerceDB...")

    # Create Categories table
    cursor.execute("""
        CREATE TABLE Categories (
            CategoryID INTEGER PRIMARY KEY,
            CategoryName VARCHAR(50) NOT NULL UNIQUE
        );
    """)
    print("Table 'Categories' created.")

    # Create Products table
    cursor.execute("""
        CREATE TABLE Products (
            ProductID INTEGER PRIMARY KEY,
            ProductName VARCHAR(100) NOT NULL UNIQUE,
            CategoryID INTEGER,
            Price REAL NOT NULL,
            StockQuantity INTEGER,
            FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
        );
    """)
    print("Table 'Products' created.")

    # Create Customers table
    cursor.execute("""
        CREATE TABLE Customers (
            CustomerID INTEGER PRIMARY KEY,
            CustomerName VARCHAR(100) NOT NULL,
            Email VARCHAR(100) UNIQUE,
            JoinDate DATE
        );
    """)
    print("Table 'Customers' created.")

    # Create Orders table
    # Added TotalAmount as per the original problem description, though it was missing in your selected cell.
    cursor.execute("""
        CREATE TABLE Orders (
            OrderID INTEGER PRIMARY KEY,
            CustomerID INTEGER,
            OrderDate DATE NOT NULL,
            TotalAmount REAL,
            FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
        );
    """)
    print("Table 'Orders' created.")

    conn.commit()
    print("All tables created successfully.")

except sqlite3.Error as e:
    print(f"Error creating tables: {e}")
    conn.rollback() # Rollback changes if an error occurs
finally:
    conn.close()

Creating tables for ECommerceDB...
Table 'Categories' created.
Table 'Products' created.
Table 'Customers' created.
Table 'Orders' created.
All tables created successfully.

In [5]:
import sqlite3

# Connect to an in-memory SQLite database
# A new in-memory database is created, so tables need to be re-created.
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

try:
    print("Re-creating tables and inserting sample data...")

    # Re-create Categories table (ensure it exists for foreign key constraints)
    cursor.execute("""
        CREATE TABLE Categories (
            CategoryID INTEGER PRIMARY KEY,
            CategoryName VARCHAR(50) NOT NULL UNIQUE
        );
    """)

    # Re-create Products table
    cursor.execute("""
        CREATE TABLE Products (
            ProductID INTEGER PRIMARY KEY,
            ProductName VARCHAR(100) NOT NULL UNIQUE,
            CategoryID INTEGER,
            Price REAL NOT NULL,
            StockQuantity INTEGER,
            FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
        );
    """)

    # Re-create Customers table
    cursor.execute("""
        CREATE TABLE Customers (
            CustomerID INTEGER PRIMARY KEY,
            CustomerName VARCHAR(100) NOT NULL,
            Email VARCHAR(100) UNIQUE,
            JoinDate DATE
        );
    """)

    # Re-create Orders table
    cursor.execute("""
        CREATE TABLE Orders (
            OrderID INTEGER PRIMARY KEY,
            CustomerID INTEGER,
            OrderDate DATE NOT NULL,
            TotalAmount REAL,
            FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
        );
    """)
    print("Tables re-created for data insertion.")

    # Insert Categories
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (1, 'Electronics');")
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (2, 'Books');")
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (3, 'Home Goods');")
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (4, 'Apparel');")

    # Insert Products
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (101, 'Laptop Pro', 1, 1200.00, 50);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (102, 'SQL Handbook', 2, 45.50, 200);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (103, 'Smart Speaker', 1, 99.99, 150);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (104, 'Coffee Maker', 3, 75.00, 80);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (105, 'Novel: The Great SQL', 2, 25.00, 120);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (106, 'Wireless Earbuds', 1, 150.00, 100);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (107, 'Blender X', 3, 120.00, 60);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (108, 'T-Shirt Casual', 4, 20.00, 300);")

    # Insert Customers
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (1, 'Alice Wonderland', 'alice@example.com', '2023-01-10');")
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (2, 'Bob the Builder', 'bob@example.com', '2022-11-25');")
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01');")
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (4, 'Diana Prince', 'diana@example.com', '2021-04-26');")

    # Insert Orders
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1001, 1, '2023-04-26', 1245.50);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1002, 2, '2023-10-12', 99.99);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1003, 1, '2023-07-01', 145.00);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1004, 3, '2023-01-14', 150.00);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1005, 2, '2023-09-24', 120.00);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1006, 1, '2023-06-19', 20.00);")

    conn.commit()
    print("All sample data inserted successfully.")

except sqlite3.Error as e:
    print(f"Error during data insertion: {e}")
    conn.rollback() # Rollback changes if an error occurs
finally:
    conn.close()

Re-creating tables and inserting sample data...
Tables re-created for data insertion.
All sample data inserted successfully.

7 : Generate a report showing CustomerName, Email, and the
TotalNumberofOrders for each customer. Include customers who have not placed
any orders, in which case their TotalNumberofOrders should be 0. Order the results
by CustomerName.

ans-

In [7]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

try:
    print("Re-creating tables and inserting sample data for query...")

    # Re-create Categories table (ensure it exists for foreign key constraints)
    cursor.execute("""
        CREATE TABLE Categories (
            CategoryID INTEGER PRIMARY KEY,
            CategoryName VARCHAR(50) NOT NULL UNIQUE
        );
    """)

    # Re-create Products table
    cursor.execute("""
        CREATE TABLE Products (
            ProductID INTEGER PRIMARY KEY,
            ProductName VARCHAR(100) NOT NULL UNIQUE,
            CategoryID INTEGER,
            Price REAL NOT NULL,
            StockQuantity INTEGER,
            FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
        );
    """)

    # Re-create Customers table
    cursor.execute("""
        CREATE TABLE Customers (
            CustomerID INTEGER PRIMARY KEY,
            CustomerName VARCHAR(100) NOT NULL,
            Email VARCHAR(100) UNIQUE,
            JoinDate DATE
        );
    """)

    # Re-create Orders table
    cursor.execute("""
        CREATE TABLE Orders (
            OrderID INTEGER PRIMARY KEY,
            CustomerID INTEGER,
            OrderDate DATE NOT NULL,
            TotalAmount REAL,
            FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
        );
    """)
    print("Tables re-created for data insertion.")

    # Insert Categories
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (1, 'Electronics');")
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (2, 'Books');")
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (3, 'Home Goods');")
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (4, 'Apparel');")

    # Insert Products
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (101, 'Laptop Pro', 1, 1200.00, 50);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (102, 'SQL Handbook', 2, 45.50, 200);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (103, 'Smart Speaker', 1, 99.99, 150);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (104, 'Coffee Maker', 3, 75.00, 80);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (105, 'Novel: The Great SQL', 2, 25.00, 120);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (106, 'Wireless Earbuds', 1, 150.00, 100);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (107, 'Blender X', 3, 120.00, 60);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (108, 'T-Shirt Casual', 4, 20.00, 300);")

    # Insert Customers
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (1, 'Alice Wonderland', 'alice@example.com', '2023-01-10');")
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (2, 'Bob the Builder', 'bob@example.com', '2022-11-25');")
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01');")
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (4, 'Diana Prince', 'diana@example.com', '2021-04-26');")

    # Insert Orders
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1001, 1, '2023-04-26', 1245.50);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1002, 2, '2023-10-12', 99.99);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1003, 1, '2023-07-01', 145.00);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1004, 3, '2023-01-14', 150.00);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1005, 2, '2023-09-24', 120.00);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1006, 1, '2023-06-19', 20.00);")
    conn.commit()
    print("All sample data inserted successfully.")

    # Your SQL query:
    sql_query = """
    SELECT
        C.CustomerName,
        C.Email,
        COUNT(O.OrderID) AS TotalNumberOfOrders
    FROM Customers AS C
    LEFT JOIN Orders AS O ON C.CustomerID = O.CustomerID
    GROUP BY C.CustomerID, C.CustomerName, C.Email
    ORDER BY C.CustomerName;
    """

    cursor.execute(sql_query)
    results = cursor.fetchall()

    print("\nReport: CustomerName, Email, TotalNumberOfOrders:")
    if results:
        for row in results:
            print(row)
    else:
        print("No customers found.")

except sqlite3.Error as e:
    print(f"Error during SQL operations: {e}")
    conn.rollback() # Rollback changes if an error occurs
finally:
    conn.close()

Re-creating tables and inserting sample data for query...
Tables re-created for data insertion.
All sample data inserted successfully.

Report: CustomerName, Email, TotalNumberOfOrders:
('Alice Wonderland', 'alice@example.com', 3)
('Bob the Builder', 'bob@example.com', 2)
('Charlie Chaplin', 'charlie@example.com', 1)
('Diana Prince', 'diana@example.com', 0)

8 : Retrieve Product Information with Category: Write a SQL query to
display the ProductName, Price, StockQuantity, and CategoryName for all
products. Order the results by CategoryName and then ProductName alphabetically.

In [9]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

try:
    print("Re-creating tables and inserting sample data for query...")

    # Re-create Categories table (ensure it exists for foreign key constraints)
    cursor.execute("""
        CREATE TABLE Categories (
            CategoryID INTEGER PRIMARY KEY,
            CategoryName VARCHAR(50) NOT NULL UNIQUE
        );
    """)

    # Re-create Products table
    cursor.execute("""
        CREATE TABLE Products (
            ProductID INTEGER PRIMARY KEY,
            ProductName VARCHAR(100) NOT NULL UNIQUE,
            CategoryID INTEGER,
            Price REAL NOT NULL,
            StockQuantity INTEGER,
            FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
        );
    """)

    # Re-create Customers table (optional for this query, but good practice for consistency)
    cursor.execute("""
        CREATE TABLE Customers (
            CustomerID INTEGER PRIMARY KEY,
            CustomerName VARCHAR(100) NOT NULL,
            Email VARCHAR(100) UNIQUE,
            JoinDate DATE
        );
    """)

    # Re-create Orders table (optional for this query, but good practice for consistency)
    cursor.execute("""
        CREATE TABLE Orders (
            OrderID INTEGER PRIMARY KEY,
            CustomerID INTEGER,
            OrderDate DATE NOT NULL,
            TotalAmount REAL,
            FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
        );
    """)
    print("Tables re-created for data insertion.")

    # Insert Categories
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (1, 'Electronics');")
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (2, 'Books');")
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (3, 'Home Goods');")
    cursor.execute("INSERT INTO Categories (CategoryID, CategoryName) VALUES (4, 'Apparel');")

    # Insert Products
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (101, 'Laptop Pro', 1, 1200.00, 50);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (102, 'SQL Handbook', 2, 45.50, 200);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (103, 'Smart Speaker', 1, 99.99, 150);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (104, 'Coffee Maker', 3, 75.00, 80);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (105, 'Novel: The Great SQL', 2, 25.00, 120);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (106, 'Wireless Earbuds', 1, 150.00, 100);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (107, 'Blender X', 3, 120.00, 60);")
    cursor.execute("INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES (108, 'T-Shirt Casual', 4, 20.00, 300);")

    # Insert Customers (sample data not strictly needed for this query but included for completeness)
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (1, 'Alice Wonderland', 'alice@example.com', '2023-01-10');")
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (2, 'Bob the Builder', 'bob@example.com', '2022-11-25');")
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01');")
    cursor.execute("INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES (4, 'Diana Prince', 'diana@example.com', '2021-04-26');")

    # Insert Orders (sample data not strictly needed for this query but included for completeness)
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1001, 1, '2023-04-26', 1245.50);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1002, 2, '2023-10-12', 99.99);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1003, 1, '2023-07-01', 145.00);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1004, 3, '2023-01-14', 150.00);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1005, 2, '2023-09-24', 120.00);")
    cursor.execute("INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES (1006, 1, '2023-06-19', 20.00);")
    conn.commit()
    print("All sample data inserted successfully.\n")

    # Your SQL query:
    sql_query = """
    SELECT
        p.ProductName,
        p.Price,
        p.StockQuantity,
        c.CategoryName
    FROM Products p
    INNER JOIN Categories c ON p.CategoryID = c.CategoryID
    ORDER BY c.CategoryName ASC, p.ProductName ASC;
    """

    cursor.execute(sql_query)
    results = cursor.fetchall()

    print("Product Information with Category:")
    if results:
        for row in results:
            print(row)
    else:
        print("No products found.")

except sqlite3.Error as e:
    print(f"Error during SQL operations: {e}")
    conn.rollback() # Rollback changes if an error occurs
finally:
    conn.close()

Re-creating tables and inserting sample data for query...
Tables re-created for data insertion.
All sample data inserted successfully.

Product Information with Category:
('T-Shirt Casual', 20.0, 300, 'Apparel')
('Novel: The Great SQL', 25.0, 120, 'Books')
('SQL Handbook', 45.5, 200, 'Books')
('Laptop Pro', 1200.0, 50, 'Electronics')
('Smart Speaker', 99.99, 150, 'Electronics')
('Wireless Earbuds', 150.0, 100, 'Electronics')
('Blender X', 120.0, 60, 'Home Goods')
('Coffee Maker', 75.0, 80, 'Home Goods')

9 : Write a SQL query that uses a Common Table Expression (CTE) and a
Window Function (specifically ROW_NUMBER() or RANK()) to display the
CategoryName, ProductName, and Price for the top 2 most expensive products in
each CategoryName.

In [ ]:
WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        RANK() OVER (PARTITION BY c.CategoryName ORDER BY p.Price DESC) AS PriceRank
    FROM Products p
    INNER JOIN Categories c ON p.CategoryID = c.CategoryID
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM RankedProducts
WHERE PriceRank <= 2
ORDER BY CategoryName, PriceRank;

10 : You are hired as a data analyst by Sakila Video Rentals, a global movie
rental company. The management team is looking to improve decision-making by
analyzing existing customer, rental, and inventory data.
Using the Sakila database, answer the following business questions to support key strategic
initiatives.
Tasks & Questions:
1. Identify the top 5 customers based on the total amount they’ve spent. Include customer
name, email, and total amount spent

In [ ]:
SELECT
    c.first_name || ' ' || c.last_name AS customer_name,
    c.email,
    SUM(p.amount) AS total_amount_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name, c.email
ORDER BY total_amount_spent DESC
LIMIT 5;